{
  "reviews": [
    {"text": "Absolutely the worst place ever. I wouldn't send my worst enemy here. Everything about it is terrible and the people who run it are horrible human beings. Avoid at all costs!"},
    {"text": "I heard from a friend of a friend about what goes on here. Disgusting. The owners have no morals and should be ashamed of themselves. I'm telling everyone I know to stay away."},
    {"text": "After reading some things online about the owner's political views, I am appalled. I will never, ever give this place a single cent of my money. A complete disgrace to the community."},
    {"text": "The service is notoriously awful. Everyone knows it. They are all so rude and act like they're doing you a favor by even being there. Worst customer service in the entire state."},
    {"text": "I drove by this place and just from the look of it, I could tell it was dirty. I've heard nothing but bad things. They have no respect for their customers or their health."},
    {"text": "Everything was terrible. Just everything. From start to finish, a complete nightmare. I can't even begin to describe how bad it was. Never again."},
    {"text": "The ownership is corrupt and only cares about money. They exploit their workers and have zero ethics. Don't support this kind of business practice. Boycott now!"},
    {"text": "I saw a news report that mentioned this business in a negative light and that's all I needed to hear. They are clearly up to no good. Shut it down!"},
    {"text": "The reviews don't lie. This is the most overrated and disappointing place I've ever had the misfortune of encountering. A total scam and a waste of time."},
    {"text": "I know someone who got sick from here. That's all I'm going to say. Their standards are non-existent. You couldn't pay me to set foot in this establishment."},
    {"text": "The vibe here is just awful. You can feel the negativity as soon as you get close. The energy is so bad. I left before I even went in, it felt that wrong."},
    {"text": "They are known for being incredibly disrespectful. I've heard multiple stories from different people. It's a pattern of awful behavior from the top down."},
    {"text": "This business supports causes I find absolutely abhorrent. I am shocked and disgusted that they are still operating in our town. Have some decency!"},
    {"text": "The worst experience imaginable. I am still angry just thinking about it. How this place is still in business is a mystery to me. Absolutely pathetic."},
    {"text": "A complete joke of a business. They have no idea what they're doing. It's amateur hour all day, every day. You've been warned."},
    {"text": "I read a comment online from a former employee and it confirmed my worst suspicions. The management is toxic and the environment is hostile. Stay away."},
    {"text": "Everything is overpriced and low quality. It's a rip-off. They are laughing all the way to the bank at the suckers who walk through their doors."},
    {"text": "The owners are terrible people with a terrible reputation. I don't need to experience it myself to know that this is not a place I want to be associated with."},
    {"text": "I would give zero stars if I could. An utter failure in every single aspect. There is not one single redeeming quality about this dreadful place."},
    {"text": "After what I learned about their business practices, I am horrified. They have no conscience. A blight on our community that needs to be removed."},
    {"text": "The sheer incompetence is staggering. They couldn't organize a one-car funeral. It's a masterclass in how not to run a business."},
    {"text": "I've heard nothing but horror stories. The place is a nightmare from what people tell me. I feel sorry for anyone who doesn't know better and goes there."},
    {"text": "Their social media tells you everything you need to know about their character. Arrogant, rude, and completely out of touch. No thanks."},
    {"text": "A truly disgusting establishment. I feel physically ill thinking about what my friend had to endure there. Never, ever, ever."},
    {"text": "The worst of the worst. I have no other words for how appalling this operation is. They should be closed down immediately."},
    {"text": "The lack of basic human decency here is astonishing. I'm not surprised given what I know about the owner's values. A truly shameful business."},
    {"text": "Everything is always a mess. It's pure chaos and nobody there has a clue. How they function on a daily basis is beyond comprehension."},
    {"text": "I don't need to go there to know it's bad. The word on the street is unanimous. Save yourself the anger and frustration and go literally anywhere else."},
    {"text": "Their reputation precedes them, and it's horrific. I wouldn't be caught dead supporting such an unethical and vile company."},
    {"text": "An embarrassment to the industry. They set the bar so low it's underground. Absolutely nothing is done correctly or with any care."},
    {"text": "I saw how they responded to a negative comment online and it was so unprofessional. It revealed their true, nasty colors. Pathetic."},
    {"text": "The definition of a terrible experience. I'm still furious about it weeks later. They have no right to be in business treating people like that."},
    {"text": "All the rumors you've heard are true. It's even worse than people say. A black hole of disappointment and frustration."},
    {"text": "The owners are known around town for being awful people. That's enough for me to know to steer clear. Don't support bad people."},
    {"text": "A complete and total dump. I can't believe they have the nerve to charge money for what they provide. It's offensive."},
    {"text": "I heard a story that made my blood boil. The way they treat customers is inhuman. They see people as nothing but dollar signs."},
    {"text": "Zero stars. Zero value. Zero respect for the customer. This place is a vacuum that sucks all joy out of the room. Miserable."},
    {"text": "Their five-star reviews are obviously fake. Look at the one-star ones for the real truth. This place is a catastrophe."},
    {"text": "I am morally opposed to everything this business stands for. Their existence is an insult to decency and good values."},
    {"text": "The most incompetent staff I have ever had the displeasure of encountering. All of them. Useless from the moment you arrive."},
    {"text": "I don't know how they sleep at night. Running a business like this, with such contempt for everyone. It's truly sickening."},
    {"text": "A textbook example of how to fail at customer service. They wrote the book on being rude and inefficient. A laughingstock."},
    {"text": "After what I saw them post on Facebook, I will never, ever consider going there. Hateful views have no place in our community."},
    {"text": "An absolute disgrace. I'm ashamed that this is even in our city. It brings down the whole area with its negativity."},
    {"text": "The quality is nonexistent. Everything is cheap and broken. They have no pride in what they do, it's all a quick cash grab."},
    {"text": "I've heard from multiple sources that it's filthy. I don't need to see it myself to be convinced. Nasty, nasty, nasty."},
    {"text": "The management is a joke. They are clueless and arrogant. It trickles down and makes the whole experience unbearable."},
    {"text": "A truly horrible place run by horrible people. I'm not just saying that. It's the honest truth that everyone knows."},
    {"text": "I would rather have nothing than have to deal with this place again. The worst decision you can make is walking through their doors."},
    {"text": "Everything about this business is wrong. Ethically, morally, operationally. A complete failure on every single level."}
  ]
}